# Домашнее задание 1 (5 баллов).

Все задания ниже имеют равный вес (5/16).

In [1]:
import pandas as pd

#### Описание данных

В папке Data находится информация о студентах. Всего 10 групп студентов. Файлы делятся на две категории:
    * Students_info_i - информация о студентах из группы i
    * Students_marks_i - оценки студентов из группы i за экзамены

### Одно из важных достоинств pandas $-$ это удобные методы реляционного взаимодействия с данными, аналогичные, например, возможностям SQL для слияния и конкатенации таблиц: merge, join, concat. Наличие готовых методов позволяет не реализовывать самостоятельно поэлементную обработку данных и оперировать сразу целыми таблицами данных.

Подробно об этих методах посмотрите тут: https://www.kaggle.com/residentmario/renaming-and-combining#Combining

#### Задание 1. Соберите всю информацию о студентах в одну таблицу df. В получившейся таблице должна быть информация и оценки всех студентов из всех групп. Напечатайте несколько строк таблицы для демонстрации результата.¶

In [2]:
info0 = pd.read_csv("C:\dataiad\Students_info_0.csv")
info1 = pd.read_csv("C:\dataiad\Students_info_1.csv")
info2 = pd.read_csv("C:\dataiad\Students_info_2.csv")
info3 = pd.read_csv("C:\dataiad\Students_info_3.csv")
info4 = pd.read_csv("C:\dataiad\Students_info_4.csv")
info5 = pd.read_csv("C:\dataiad\Students_info_5.csv")
info6 = pd.read_csv("C:\dataiad\Students_info_6.csv")
info7 = pd.read_csv("C:\dataiad\Students_info_7.csv")
info8 = pd.read_csv("C:\dataiad\Students_info_8.csv")
info9 = pd.read_csv("C:\dataiad\Students_info_9.csv")
info = pd.DataFrame(pd.concat([info0,info1,info2,info3,info4,info5,info6,info7,info8,info9]))

In [3]:
marks0 = pd.read_csv("C:\dataiad\Students_marks_0.csv")
marks1 = pd.read_csv("C:\dataiad\Students_marks_1.csv")
marks2 = pd.read_csv("C:\dataiad\Students_marks_2.csv")
marks3 = pd.read_csv("C:\dataiad\Students_marks_3.csv")
marks4 = pd.read_csv("C:\dataiad\Students_marks_4.csv")
marks5 = pd.read_csv("C:\dataiad\Students_marks_5.csv")
marks6 = pd.read_csv("C:\dataiad\Students_marks_6.csv")
marks7 = pd.read_csv("C:\dataiad\Students_marks_7.csv")
marks8 = pd.read_csv("C:\dataiad\Students_marks_8.csv")
marks9 = pd.read_csv("C:\dataiad\Students_marks_9.csv")
marks = pd.DataFrame(pd.concat([marks0,marks1,marks2,marks3,marks4,marks5,marks6,marks7,marks8,marks9]))

In [4]:
df = pd.merge(info, marks, how='inner', left_on='index', right_on='index')

In [5]:
df

,index,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,1,female,group C,some college,standard,completed,group1,69,90,88
2,2,female,group B,master's degree,standard,none,group1,90,95,93
3,3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,4,male,group C,some college,standard,none,group1,76,78,75
...,...,...,...,...,...,...,...,...,...,...
995,995,female,group E,master's degree,standard,completed,group10,88,99,95
996,996,male,group C,high school,free/reduced,none,group10,62,55,55
997,997,female,group C,high school,free/reduced,completed,group10,59,71,65
998,998,female,group D,some college,standard,completed,group10,68,78,77
999,999,female,group D,some college,free/reduced,none,group10,77,86,86

#### Задание 2. Удалите столбец index у полученной таблицы. Напечатайте первые 10 строк таблицы.

In [6]:
df = df.drop("index", axis=1)
df.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75
5,female,group B,associate's degree,standard,none,group1,71,83,78
6,female,group B,some college,standard,completed,group1,88,95,92
7,male,group B,some college,free/reduced,none,group1,40,43,39
8,male,group D,high school,free/reduced,completed,group1,64,64,67
9,female,group B,high school,free/reduced,none,group1,38,60,50

#### Задание 3. Выведите на экран размеры полученной таблицы

In [7]:
shape = df.shape
print(shape[0], 'rows x', shape[1], 'columns')

1000 rows x 9 columns

#### Задание 4. Выведите на экран статистические характеристики числовых столбцов таблицы (минимум, максимум, среднее значение, стандартное отклонение)

In [8]:
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

#### Задание 5. Проверьте, есть ли в таблице пропущенные значения

По count видно, что пропусков нет

Еще можно проверить так: если пропусков нет, то ниже должны быть только нули

In [9]:
df.isnull().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
group                          0
math score                     0
reading score                  0
writing score                  0
dtype: int64

#### Задание 6. Выведите на экран средние баллы студентов по каждому предмету (math, reading, writing)

In [10]:
df[["math score", "reading score", "writing score"]].mean()

math score       66.089
reading score    69.169
writing score    68.054
dtype: float64

**Задание 7. Как зависят оценки от того, проходил ли студент курс для подготовки к сдаче экзамена (test preparation course)? Выведите на экран для каждого предмета в отдельности средний балл студентов, проходивших курс для подготовки к экзамену и не проходивших курс.**

In [11]:
df.groupby("test preparation course")["math score"].mean()

test preparation course
completed    69.695531
none         64.077882
Name: math score, dtype: float64

In [12]:
df.groupby("test preparation course")["reading score"].mean()

test preparation course
completed    73.893855
none         66.534268
Name: reading score, dtype: float64

apply не обязательно

In [13]:
df.groupby("test preparation course")["writing score"].apply(lambda x: x.mean())

test preparation course
completed    74.418994
none         64.504673
Name: writing score, dtype: float64

**Задание 8. Выведите на экран все различные значения из столбца lunch.**

In [14]:
print(*set(df["lunch"]), sep='\n')

standard
free/reduced

**Задание 9. Переименуйте колонку "parental level of education" в "education", а "test preparation course" в "test preparation" с помощью метода pandas rename**
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html

In [15]:
df = df.rename(columns={"parental level of education": "education", "test preparation course": "test preparation"})

**Зафиксируем минимальный балл для сдачи экзамена**

In [16]:
passmark = 50

**Задание 10. Ответьте на вопросы:**
    * Какая доля студентов сдала экзамен по математике (passmark >= 50)?
    * Какая доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике?
    * Какая доля женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике?

In [17]:
(df["math score"] >= passmark).sum() / len(df)

0.865

In [18]:
len(df[(df["test preparation"] == "completed") & (df["math score"] >= passmark)]) / len(df)

0.33

In [27]:
df[(df["test preparation"] == "completed") & (df["math score"] >= passmark)]

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score
1,female,group C,some college,standard,completed,group1,69,90,88
6,female,group B,some college,standard,completed,group1,88,95,92
8,male,group D,high school,free/reduced,completed,group1,64,64,67
13,male,group A,some college,standard,completed,group1,78,72,70
21,female,group B,some college,free/reduced,completed,group1,65,75,70
...,...,...,...,...,...,...,...,...,...
990,male,group E,high school,free/reduced,completed,group10,86,81,75
991,female,group B,some high school,standard,completed,group10,65,82,78
995,female,group E,master's degree,standard,completed,group10,88,99,95
997,female,group C,high school,free/reduced,completed,group10,59,71,65
998,female,group D,some college,standard,completed,group10,68,78,77

In [31]:
compl_st = df[df['test preparation'] == 'completed']
compl_st["math score"] >= passmark

1       True
6       True
8       True
13      True
18     False
       ...
990     True
991     True
995     True
997     True
998     True
Name: math score, Length: 358, dtype: bool

In [20]:
(df[df['test preparation'] == 'completed']["math score"] >= passmark).mean()

0.9217877094972067

In [32]:
True + True + False

2

In [19]:
len(df[(df["gender"] == "female") & (df["test preparation"] == "none") & (df["math score"] < passmark)]) / len(df)

0.07

**Задание 11. С помощью groupby выполните задания ниже. Также выведите время выполнения каждого из заданий.**
    * Для каждой этнической группы выведите средний балл за экзамен по чтению
    * Для каждого уровня образования выведите минимальный балл за экзамен по письму

In [27]:
%%time
df.groupby("race/ethnicity")["reading score"].mean()

Wall time: 3 ms

race/ethnicity
group A    64.674157
group B    67.352632
group C    69.103448
group D    70.030534
group E    73.028571
Name: reading score, dtype: float64

In [26]:
%%time
df.groupby("education")["writing score"].min()

Wall time: 3 ms

education
associate's degree    35
bachelor's degree     38
high school           15
master's degree       46
some college          19
some high school      10
Name: writing score, dtype: int64

**Задание 12. Выполните задание 11 с помощью циклов. Сравните время выполнения.**

In [24]:
%%time
slist = [0, 0, 0, 0, 0]
klist = [0, 0, 0, 0, 0]
for i in range(0,1000):
    x = df["race/ethnicity"][i]
    if x == "group A":
        slist[0] += df["reading score"][i]
        klist[0] += 1
    elif x == "group B":
        slist[1] += df["reading score"][i]
        klist[1] += 1
    elif x == "group C":
        slist[2] += df["reading score"][i]
        klist[2] += 1
    elif x == "group D":
        slist[3] += df["reading score"][i]
        klist[3] += 1
    else: 
        slist[4] += df["reading score"][i]
        klist[4] += 1
letters = 'ABCDE'
for i in range(5):
    print('group', letters[i], '  ', slist[i]/klist[i])

group A    64.67415730337079
group B    67.35263157894737
group C    69.10344827586206
group D    70.03053435114504
group E    73.02857142857142
Wall time: 159 ms

In [25]:
%%time
min = [100, 100, 100, 100, 100, 100]
for i in range(0,1000):
    x = df["education"][i]
    if x == "associate's degree":
        if df["writing score"][i] < min[0]:
            min[0] = df["writing score"][i]
    elif x == "bachelor's degree":
        if df["writing score"][i] < min[1]:
            min[1] = df["writing score"][i]
    elif x == "high school":
        if df["writing score"][i] < min[2]:
            min[2] = df["writing score"][i]
    elif x == "master's degree":
        if df["writing score"][i] < min[3]:
            min[3] = df["writing score"][i]
    elif x == "some college":
        if df["writing score"][i] < min[4]:
            min[4] = df["writing score"][i]
    else: 
        if df["writing score"][i] < min[5]:
            min[5] = df["writing score"][i]
for i in range(6):
    print(sorted(set(df['education']))[i], min[i])

associate's degree 35
bachelor's degree 38
high school 15
master's degree 46
some college 19
some high school 10
Wall time: 45 ms

**Задание 13. Выведите на экран средние баллы студентов по каждому предмету в зависимости от пола и уровня образования. То есть должно получиться количество групп, равных 2 * (число уровней образования), и для каждой такой группы выыведите средний балл по каждому из предметов.**

Это можно сделать с помощью сводных таблиц (pivot_table):

https://www.kaggle.com/kamilpolak/tutorial-how-to-use-pivot-table-in-pandas

In [28]:
pd.pivot_table(df, index=['education','gender'])

                           math score  reading score  writing score
education          gender
associate's degree female   65.250000      74.120690      74.000000
                   male     70.764151      67.433962      65.405660
bachelor's degree  female   68.349206      77.285714      78.380952
                   male     70.581818      68.090909      67.654545
high school        female   59.351064      68.202128      66.691489
                   male     64.705882      61.480392      58.539216
master's degree    female   66.500000      76.805556      77.638889
                   male     74.826087      73.130435      72.608696
some college       female   65.406780      73.550847      74.050847
                   male     69.009259      64.990741      63.148148
some high school   female   59.296703      69.109890      68.285714
                   male     67.840909      64.693182      61.375000

#### Задание 14. Сколько студентов успешно сдали экзамен по математике?

Создайте новый столбец в таблице df под названием Math_PassStatus и запишите в него F, если студент не сдал экзамен по математике (балл за экзамен < passmark), и P иначе.

Посчитайте количество студентов, сдавших и не сдавших экзамен по математике.

Сделайте аналогичные шаги для экзаменов по чтению и письму.

In [33]:
df["Math_PassStatus"] = df["math score"].apply(lambda x: 'F' if x < passmark else 'P')
print('Сдали математику', len(df[df['Math_PassStatus'] == 'P']))
print('Не сдали математику', len(df[df['Math_PassStatus'] == 'F']))

Сдали математику 865
Не сдали математику 135

In [34]:
df["Reading_PassStatus"] = df["reading score"].apply(lambda x: 'F' if x < passmark else 'P')
print('Сдали чтение', len(df[df['Reading_PassStatus'] == 'P']))
print('Не сдали чтение', len(df[df['Reading_PassStatus'] == 'F']))

Сдали чтение 910
Не сдали чтение 90

In [35]:
df["Writing_PassStatus"] = df["writing score"].apply(lambda x: 'F' if x < passmark else 'P')
print('Сдали письмо', len(df[df['Writing_PassStatus'] == 'P']))
print('Не сдали письмо', len(df[df['Writing_PassStatus'] == 'F']))

Сдали письмо 886
Не сдали письмо 114

#### Задание 15. Сколько студентов успешно сдали все экзамены?

Создайте столбец OverAll_PassStatus и запишите в него для каждого студента 'F', если студент не сдал хотя бы один из трех экзаменов, а иначе 'P'.

Посчитайте количество студентов, которые сдали все экзамены.

In [36]:
df["OverAll_PassStatus"] = (df["Math_PassStatus"] == 'P') & (df["Reading_PassStatus"] == 'P') & (df["Writing_PassStatus"] == 'P')
df["OverAll_PassStatus"] = df["OverAll_PassStatus"].apply(lambda x: 'P' if x else 'F')
len(df[df["OverAll_PassStatus"] == 'P'])

812

#### Задание 16. Переведем баллы в оценки

### Система перевода баллов в оценки
####    больше 90 = A
####      80-90 = B
####      70-80 = C
####      60-70 = D
####      50-60 = E
####    меньше 50 = F (Fail)

Создайте вспомогательную функцию, которая будет по среднему баллу за три экзамена выставлять оценку студенту по данным выше критериям.

Создайте столбец Grade и запишите в него оценку каждого студента.

Выведите количество студентов, получивших каждую из оценок.

**В случае, если средний балл попадает на границу между оценками (т.е. равен ровно 60, 70 или 80 баллов), вы можете интерпретировать условие на своё усмотрение (т.е. можете поставить за 60 баллов оценку D, а можете - E).**

In [37]:
def GetGrade(average_mark):
    if average_mark > 90:
        return 'A'
    elif 80 < average_mark <= 90:
        return 'B'
    elif 70 < average_mark <= 80:
        return 'C'
    elif 60 < average_mark <= 70:
        return 'D'
    elif 50 <= average_mark <= 60:
        return 'E'
    else:
        return 'F'

df['Grade'] = ((df["math score"] + df["reading score"] + df["writing score"])/3).apply(GetGrade)

In [38]:
df.groupby('Grade')["lunch"].count()

Grade
A     50
B    144
C    253
D    260
E    190
F    103
Name: lunch, dtype: int64